# DimLeader Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimLeader Property
ParameterTypeId Class See Also
---
"Leader"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimLeader { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimLeader As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimLeader {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace